In [1]:
import pandas as pd
from sqlalchemy import create_engine
import csv
df = pd.read_csv('1NF_ABC_FOODMART.csv')

In [2]:
df.head()

,location_id,location_name,address,city,state,zip_code,employee_id,first_name,last_name,email,...,transaction_type,amount,transaction_date,expense_id,expense_date,expense_descriptoon,amount.1,shelf_id,shelf_content_id,quantity_on_shelf
0,1,Queens #1,123 Main St,Queens,NY,11111,1,John,Doe,john.doe@email.com,...,Debit,15.75,11/1/23,1,11/1/23,Utility Bill,500,1,1,100
1,2,Queens #2,456 Elm St,Queens,NY,22222,2,Jane,Smith,jane.smith@email.com,...,Debit,3.50,11/2/23,2,11/2/23,Cleaning Supplies,75,2,2,50
2,3,Brooklyn #1,789 Oak St,Brooklyn,NY,33333,3,Mike,Johnson,mike.johnson@email.com,...,Credit,45.75,11/2/23,3,11/3/23,Rent,1500,3,3,25
3,4,Brooklyn #2,101 Pine St,Brooklyn,NY,44444,4,Sarah,Lee,sarah.lee@email.com,...,Debit,7.50,11/3/23,4,11/4/23,Advertising,250,4,4,20
4,5,Brooklyn #3,202 Maple St,Brooklyn,NY,55555,5,David,Brown,david.brown@email.com,...,Debit,75.00,11/4/23,5,11/5/23,Repairs,300,5,5,80

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 57 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   location_id          5 non-null      int64
 1   location_name        5 non-null      object
 2   address              5 non-null      object
 3   city                 5 non-null      object
 4   state                5 non-null      object
 5   zip_code             5 non-null      int64
 6   employee_id          5 non-null      int64
 7   first_name           5 non-null      object
 8   last_name            5 non-null      object
 9   email                5 non-null      object
 10  phone                5 non-null      object
 11  position             5 non-null      object
 12  date                 5 non-null      object
 13  shift_start_time     5 non-null      object
 14  shift_end_time       5 non-null      object
 15  hourly_wage          5 non-null      object
 16  item_id              5 non-null      int64
 17  item_name            5 non-null      object
 18  description          5 non-null      object
 19  category_id          5 non-null      int64
 20  category_name        5 non-null      object
 21  cost_price           5 non-null      float64
 22  retail_price         5 non-null      float64
 23  quantity_in_stock    5 non-null      int64
 24  supplier_id          5 non-null      int64
 25  supplier_name        5 non-null      object
 26  contact_name         5 non-null      object
 27  contact_phone        5 non-null      object
 28  contact_email        5 non-null      object
 29  delivery_id          5 non-null      int64
 30  delivery_date        5 non-null      object
 31  quantity_delivered   5 non-null      int64
 32  unit_price           5 non-null      float64
 33  sale_id              5 non-null      int64
 34  sale_date            5 non-null      object
 35  total_amount         5 non-null      float64
 36  customer_id          5 non-null      int64
 37  first_name.1         5 non-null      object
 38  last_name.1          5 non-null      object
 39  email.1              5 non-null      object
 40  phone.1              5 non-null      object
 41  address.1            5 non-null      object
 42  transaction_id       5 non-null      int64
 43  transaction_item_id  5 non-null      int64
 44  quantity_sold        5 non-null      int64
 45  unit_price.1         5 non-null      float64
 46  accounting_id        5 non-null      int64
 47  transaction_type     5 non-null      object
 48  amount               5 non-null      float64
 49  transaction_date     5 non-null      object
 50  expense_id           5 non-null      int64
 51  expense_date         5 non-null      object
 52  expense_descriptoon  5 non-null      object
 53  amount.1             5 non-null      int64
 54  shelf_id             5 non-null      int64
 55  shelf_content_id     5 non-null      int64
 56  quantity_on_shelf    5 non-null      int64
dtypes: float64(6), int64(20), object(31)
memory usage: 2.4+ KB

In [4]:
#assign connection to variable
conn = 'postgresql://postgres:123@localhost/ABCFOODMART'

In [5]:
#create engine to connect to database
engine = create_engine(conn)

In [6]:
#connection
connection = engine.connect()

In [7]:
#SQL statements to create all tables in the schema
sql_statement = """

CREATE TABLE shelf_contents (
    shelf_content_id INT,
    shelf_id INT NOT NULL,
    item_id INT NOT NULL,
    quantity_on_shelf INT NOT NULL,
    PRIMARY KEY (shelf_content_id),
    FOREIGN KEY (shelf_id) REFERENCES shelves(shelf_id),
    FOREIGN KEY (item_id) REFERENCES InventoryItems(item_id)
);

CREATE TABLE transaction_items (
    transaction_item_id INT,
    transaction_id INT NOT NULL,
    item_id INT NOT NULL,
    quantity_sold INT NOT NULL,
    unit_price DECIMAL(5, 2) NOT NULL,
    PRIMARY KEY (transaction_item_id),
    FOREIGN KEY (transaction_id) REFERENCES transactions(transaction_id),
    FOREIGN KEY (item_id) REFERENCES inventory_items(item_id)
);

CREATE TABLE location (
    location_id INT,
    location_name VARCHAR(50) NOT NULL,
    address VARCHAR(50) NOT NULL,
    city VARCHAR(50) NOT NULL,
    state VARCHAR(20) NOT NULL,
    zip_code VARCHAR(10) NOT NULL,
    PRIMARY KEY (location_id)
);

CREATE TABLE employees (
    employee_id INT,
    first_name VARCHAR(30) NOT NULL,
    last_name VARCHAR(30) NOT NULL,
    email VARCHAR(50) NOT NULL,
    phone VARCHAR(20) NOT NULL,
    position VARCHAR(25) NOT NULL,
    location_id INT NOT NULL,
    PRIMARY KEY (employee_id),
    FOREIGN KEY (location_id) REFERENCES location(location_id)
);

CREATE TABLE employee_shifts (
    employee_id INT,
    date DATE NOT NULL,
    shift_start_time TIME NOT NULL,
    shift_end_time TIME NOT NULL,
    hourly_wage DECIMAL(5, 2) NOT NULL,
    location_id INT NOT NULL,
    accounting_id INT NOT NULL,
    PRIMARY KEY (employee_id),
    FOREIGN KEY (location_id) REFERENCES location(location_id),
    FOREIGN KEY (accounting_id) REFERENCES accounting(accounting_id)
);


"""

In [8]:
#create shelf_contents df
shelf_contents = df[['shelf_content_id', 'shelf_id', 'item_id','quantity_on_shelf']]
shelf_contents

   shelf_content_id  shelf_id  item_id  quantity_on_shelf
0                 1         1        1                100
1                 2         2        2                 50
2                 3         3        3                 25
3                 4         4        4                 20
4                 5         5        5                 80

In [10]:
#push shelf_contents df to sql
shelf_contents.to_sql('shelf_contents',con=engine, if_exists='append', index=False)

5

In [11]:
#create transaction_items df
transaction_items = df[['transaction_item_id', 'transaction_id',  'item_id', 'quantity_sold', 'unit_price']]
transaction_items

   transaction_item_id  transaction_id  item_id  quantity_sold  unit_price
0                    1               1        1              5        0.45
1                    2               2        2              3        1.90
2                    3               3        3              2        1.10
3                    4               4        4              1        3.75
4                    5               5        5              4        0.70

In [13]:
#push transaction_items df to sql
transaction_items.to_sql('transaction_items',con=engine, if_exists='append', index=False)

5

In [15]:
#create location df
location = df[['location_name']].drop_duplicates()
location = location.dropna(subset=['location_name'])
location = df[['location_id', 'location_name', 'address', 'city','state', 'zip_code']]
location

   location_id location_name       address      city state  zip_code
0            1     Queens #1   123 Main St    Queens    NY     11111
1            2     Queens #2    456 Elm St    Queens    NY     22222
2            3   Brooklyn #1    789 Oak St  Brooklyn    NY     33333
3            4   Brooklyn #2   101 Pine St  Brooklyn    NY     44444
4            5   Brooklyn #3  202 Maple St  Brooklyn    NY     55555

In [16]:
#push location df to sql
location.to_sql('location',con=engine, if_exists='append', index=False)

5

In [20]:
#create employees df
employees = df[['first_name', 'last_name']].drop_duplicates()
employees = employees.dropna(subset=['first_name', 'last_name'])
employees = df[['employee_id', 'first_name',  'last_name', 'email', 'phone', 'position', 'location_id']]
employees

,employee_id,first_name,last_name,email,phone,position,location_id
0,1,John,Doe,john.doe@email.com,555-123-4567,Manager,1
1,2,Jane,Smith,jane.smith@email.com,555-234-5678,Cashier,2
2,3,Mike,Johnson,mike.johnson@email.com,555-345-6789,Cashier,3
3,4,Sarah,Lee,sarah.lee@email.com,555-456-7890,Manager,4
4,5,David,Brown,david.brown@email.com,555-567-8901,Cashier,5

In [21]:
#push employees to sql
employees.to_sql('employees',con=engine, if_exists='append', index=False)

5

In [22]:
#create employee_shifts df
employee_shifts = df[['employee_id', 'date',  'shift_start_time', 'shift_end_time', 'hourly_wage', 'location_id', 'accounting_id']]
employee_shifts

,employee_id,date,shift_start_time,shift_end_time,hourly_wage,location_id,accounting_id
0,1,11/26/23,7:00,19:00,$20,1,1
1,2,11/26/23,7:00,13:00,$25,2,2
2,3,11/26/23,13:00,19:00,$22,3,3
3,4,11/26/23,7:00,19:00,$18,4,4
4,5,11/26/23,7:00,13:00,$20,5,5

In [23]:
#push employee_shifts to sql
employee_shifts.to_sql('employee_shifts',con=engine, if_exists='append', index=False)

5